first_r_c/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "George"], ["email", "george@gmail.com"], ["created_at", "2021-11-10 21:50:51.652529"], ["updated_at", "2021-11-10 21:50:51.652529"]]
---
    def create
        user = User.new(user_params)
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save