first_r_c/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def index
        #render plain: "I'm in the index action!"
        @users = User.all